set_time_format -unit ns -decimal_places 3

#**************************************************************
# Create Clock
#**************************************************************
create_clock -period "50.0 MHz" [get_ports {max10_clk1_50}]
create_clock -period "60.0 MHz" [get_ports {ft_clk}]

#**************************************************************
# Create Generated Clock
#**************************************************************
derive_pll_clocks

#**************************************************************
# Set Clock Latency
#**************************************************************

#**************************************************************
# Set Clock Uncertainty
#**************************************************************
derive_clock_uncertainty

#**************************************************************
# Set Input Delay
#**************************************************************
set_input_delay -clock [get_clocks {ft_clk}] 8.333 [get_ports {ft_data[*] ft_rxfn ft_txen}]

#**************************************************************
# Set Output Delay
#**************************************************************
set_output_delay -clock [get_clocks {ft_clk}] -min 8.333 [get_ports {ft_data[*] ft_oen ft_wrn ft_rdn ft_siwua}]
set_output_delay -clock [get_clocks {ft_clk}] -max 4.0 [get_ports {ft_data[*] ft_oen ft_wrn ft_rdn ft_siwua}]

#**************************************************************
# Set Clock Groups
#**************************************************************
set_clock_groups -asynchronous -group [get_clocks {ft_clk}] -group [get_clocks {max10_clk1_50}]

#**************************************************************
# Set False Path
#**************************************************************
set_false_path -from [get_clocks {max10_clk1_50}] -to [get_ports {ledr[*]}]
set_false_path -from [get_clocks {ft_clk}] -to [get_ports {ledr[*]}]

#**************************************************************
# Set Multicycle Path
#**************************************************************

#**************************************************************
# Set Maximum Delay
#**************************************************************

#**************************************************************
# Set Minimum Delay
#**************************************************************

#**************************************************************
# Set Input Transition
#**************************************************************

#**************************************************************
# Set Load
#**************************************************************
